vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MCXA343_DFP.pdsc
    <condition id="allOf.anyOf=driver.edma4, driver.lpuart, driver.edma4, device=MCXA343.internal_condition">
      <require condition="anyOf.driver.edma4.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mau.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mcx_cmc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mcx_spc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mcx_vbat.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.opamp_fast.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.ostimer.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.psp27801.condition_id">
      <require condition="allOf.driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.pwm.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.romapi.condition_id">
      <require condition="allOf.driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.rtc.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.rtt.condition_id">
      <require condition="allOf.driver.rtt.template, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="allOf.driver.rtt.template, device=MCXA343.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rtt template"/>
      <require condition="device.MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.rtt.template.condition_id">
      <require condition="allOf.device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.smartdma.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.smartdma_mcxa.condition_id">
      <require condition="allOf.anyOf=device_id=MCXA343, driver.smartdma.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=device_id=MCXA343, driver.smartdma.internal_condition">
      <require condition="anyOf.device_id=MCXA343.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smartdma"/>
    </condition>
    <condition id="anyOf.device_id=MCXA343.internal_condition">
      <accept condition="device_id.MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.ssd1963.condition_id">
      <require condition="allOf.driver.dbi, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="allOf.driver.dbi, device=MCXA343.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dbi"/>
      <require condition="device.MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.st7796s.condition_id">
      <require condition="allOf.driver.dbi, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.tma525b.condition_id">
      <require condition="allOf.device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.trdc_1.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343, driver.trdc_soc.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=MCXA343, driver.trdc_soc.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.MCXA343.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="trdc_soc"/>
    </condition>
    <condition id="driver.trdc_soc.condition_id">
      <require condition="allOf.device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.utick.condition_id">
      <require condition="allOf.driver.common, device_id=MCXA343.internal_condition"/>
    </condition>
    <condition id="driver.video-common.condition_id">
      <require condition="allOf.driver.common, device=MCXA343.internal_condition"/>
    </condition>
